package com.test.cotest.co05;
/*
 * 이진탐색. 데이터가 정렬되있는 상태에서 원하는' 값을 찾아내는' 알고리즘이다. 
 * 대상데이터의 중앙값과 , 찾고자 하는 값을 비교해서 데이터 크기를 절반씩 줄이면서 대상을 찾음
 * 이진탐색은 정렬데이터에서 원하는 데이터를 탐색할때 사용하는 가장 일반적인 알고리즘이다
 * 
 * 이진탐색과정
 * 1. 현재 데이터셋의 중앙값 선택
 * 2. 중앙값>타깃데이터 일때 중앙값 기준으로 왼쪽데이터셋을 선택한다 
 * 3. 중앙값<타깃데이터 일때 중앙값 기준으로 오른쪽데이터셋을 선택한다 
 * 4. 과정 (1)~(3) 반복하다가 중앙값==타깃데이터일때 탐색을 종료한다.
 * 
 * 원하는 정수찾기
 * N개의 정수가 주어졌을떄 이안에 X라는 정수가 존재하는지 찾는 프로그램
 * 1번째줄에 데이터개수N개 입력받기, 2번째줄에 N개의 정수들, 3번째줄에 찾아야할 숫자개수입력, 4번째줄에 M개의 수들이 주어짐 .(?)
 * 
 * 5
 * 4 1 5 2 3
 * 5 
 * 1 3 7 9 5
 * 입력시
 * 
 * 1
 * 1
 * 0
 * 0
 * 1 
 * 출력
 * 41523 중에서 13795 정수가 있는지
 */
public class search09_binarySearch {
	public static void main(String[] args) {
		
	}

}
