package com.test.cotest.co03;
/*
 * 슬라이딩윈도우가 뭘까? 2개의 포인터로 범위 지정한다음 범위를 유지한채로, 이동하여 문제 해결하는거
 * 투포인터 알고리즘과 비슷(i,j..)
 * 
 * DNA비밀번호 문제
 * DNA문자열은 모든 문자열에 등장하는 문자가 {A,C,G,T}인것이다. 예를들어 ACKA는 아닌데, ACCA는 해당함..
 * 이런 문자열에 매료가 됐대 (대체왜??..) 근데 이런방법에는 큰 문제가 있다. 임의의 DNA문자열 추출했을때 AAAA같은 보안에 취약한 문자열이 발생가능!
 * 그래서 A는 1개이상, C는 1개이상, G는 1개이상, T는 0개이상 이런식으로 등장해야 비번을 사용할수 있다고 가정 해보자.
 * 이떄 ACCT는 조건만족 X, GCCA는 가능. 
 * 
 * 민호가 만든 임의의 DNA문자열과 비밀번호로 사용할부분 문자열의 길이, 그리고 ACGT가 각각 몇번이상 등장해야 비번 사용할수 있는지..
 * 순서대로 주어졌을떄 민호가 만들수 있는 비번 종류 수를 구하는 프로그램 작성하라..
 * 
 * ( 단 부분 문자열 등장위치가 다르면 부분문자열 내용이같더라도 다른 문자열로 취급함. )
 * 
 */
public class slidingWindow {
	public static void main(String[] args) {
		
	}
}
